Revit 2027 API
BuiltInFailures.SplineFailures.ClosedSpline Property
 Closed or self-intersecting splines are not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ClosedSpline { get; }
Public Shared ReadOnly Property ClosedSpline As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ClosedSpline {
	FailureDefinitionId^ get ();
}
static member ClosedSpline : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SplineFailures Class
Autodesk.Revit.DB Namespace